{
    "Ace Your Interview with AI": "使用AI通过你的面试",
    "Analyzing": "正在分析",
    "Begin": "开始",
    "Behavioral": "行为的",
    "Completed": "已完成",
    "Created": "已创建",
    "Credits": "积分",
    "Email": "电子邮件",
    "Enhance Responses": "增强回应",
    "Generate": "生成",
    "Generate Interview": "生成面试",
    "Generating Feedback": "生成反馈",
    "Generating Interview": "正在生成面试",
    "Get Feedback": "获取反馈",
    "Get Started": "开始",
    "Hello": "你好",
    "In Progress": "进行中",
    "Interview": "面试",
    "Interview Type": "面试类型",
    "Interviewer": "面试官",
    "Job Listing or Description": "工作列表或描述",
    "Job Title": "职位名称",
    "Master your next job interview with AI! Upload your resume, input the job description, and dive into a realistic interview experience tailored just for you. Receive instant feedback and refine your responses to make a stellar impression every time.": "使用AI掌握你的下一次工作面试！上传你的简历，输入工作描述，然后深入体验为你量身定制的真实面试体验。立即获得反馈，并且每次都优化你的回答，留下出色的印象。",
    "None": "无",
    "Our AI analyzes your resume and the job description to generate interview questions specifically tailored to your application, ensuring a highly relevant practice experience.": "我们的AI分析你的简历和工作描述，生成专门针对你的申请的面试问题，确保一个高度相关的实践经验。",
    "Practice answering interview questions naturally by speaking your responses. Our advanced speech-to-text technology accurately transcribes your answers for easy review and analysis.": "通过口头回答面试问题来自然练习。我们先进的语音转文字技术准确转录你的回答，便于审核和分析。",
    "Provide Info": "提供信息",
    "Provide a brief job listing or description to help us ask relevant questions for. You can copy and paste directly from a job listing or description.": "提供一个简短的工作列表或描述，帮助我们提出相关问题。你可以直接从工作列表或描述中复制和粘贴。",
    "Ready": "准备好了",
    "Receive comprehensive feedback on your interview performance, including insights on your strengths and areas for improvement. Our AI-powered analytics help you track your progress and refine your interview skills.": "接收关于你的面试表现的全面反馈，包括你的优势和需要改进的领域的洞察。我们的AI驱动分析帮助你跟踪进度并提炼你的面试技巧。",
    "Resume": "简历",
    "Sign In to Begin": "登录开始",
    "Sign Out": "登出",
    "Simulate your interview with AI": "用AI模拟你的面试",
    "Status": "状态",
    "Strengths": "优势",
    "Technical": "技术的",
    "Total Questions": "总问题数",
    "Upload Resume": "上传简历",
    "Upload a pdf, png, or jpeg of your resume to help the AI ask personalized questions.": "上传你的简历的pdf、png或jpeg文件，以帮助AI提出个性化问题。",
    "Upload resume": "上传简历",
    "View": "查看",
    "View Results": "查看结果",
    "We are analyzing your response and gathering detailed feedback. Don't leave! You're almost there. This will only take a few moments.": "我们正在分析你的回应并收集详细反馈。不要离开！你快完成了。这只会花费几分钟。",
    "Weaknesses": "弱点",
    "Working on it!": "正在处理中！",
    "Your Response": "你的回答",
    "Your interview history will always be saved. If you need to leave this page before starting your interview, you can view the interview later by clicking your avatar in the top right and selecting \"My Interviews\".": "你的面试历史将始终被保存。如果你需要在开始面试前离开此页面，你可以通过点击右上角的你的头像并选择\"我的面试\"来稍后查看面试。",
  "Your personalized interview is ready. Click the button below to start your interview.": "你的个性化面试已经准备好了。点击下面的按钮开始你的面试。",
  "second": "秒"
}