{
  "Hello": "Hola",
  "Email": "Correo electrónico",
  "Credits": "Créditos",
  "Sign Out": "Cerrar sesión",
  "Master your next job interview with AI! Upload your resume, input the job description, and dive into a realistic interview experience tailored just for you. Receive instant feedback and refine your responses to make a stellar impression every time.": "¡Domina tu próxima entrevista de trabajo con IA! Sube tu currículum, introduce la descripción del trabajo y sumérgete en una experiencia de entrevista realista diseñada especialmente para ti. Recibe comentarios instantáneos y refina tus respuestas para causar una impresión estelar cada vez.",
  "Get Started": "Empezar",
  "Simulate your interview with AI": "Simula tu entrevista con IA",
  "View": "Ver",
  "Begin": "Comenzar",
  "Resume": "Currículum",
  "View Results": "Ver Resultados",
  "Generating Interview": "Generando Entrevista",
  "Ready": "Listo",
  "In Progress": "En Progreso",
  "Generating Feedback": "Generando Retroalimentación",
  "Completed": "Completado",
  "Created": "Creado",
  "Total Questions": "Total de Preguntas",
  "Status": "Estado",
  "Your personalized interview is being generated. This may take a few moments.": "Tu entrevista personalizada se está generando. Esto puede tomar unos momentos.",
  "Provide Info": "Proveer Información",
  "Generate": "Generar",
  "Generate Interview": "Generar Entrevista",
  "Interview": "Entrevista",
  "Get Feedback": "Obtener Retroalimentación",
  "Working on it!": "¡Trabajando en ello!",
  "Your interview history will always be saved. If you need to leave this page before starting your interview, you can view the interview later by clicking your avatar in the top right and selecting \"My Interviews\".": "Tu historial de entrevistas siempre se guardará. Si necesitas dejar esta página antes de comenzar tu entrevista, puedes ver la entrevista más tarde haciendo clic en tu avatar en la parte superior derecha y seleccionando \"Mis Entrevistas\".",
  "Your personalized interview is ready. Click the button below to start your interview.": "Tu entrevista personalizada está lista. Haz clic en el botón de abajo para comenzar tu entrevista.",
  "second": "segundo",
  "We are analyzing your response and gathering detailed feedback. Don't leave! You're almost there. This will only take a few moments.": "Estamos analizando tu respuesta y recopilando retroalimentación detallada. ¡No te vayas! Ya casi estás. Esto solo tomará unos momentos.",
  "Analyzing": "Analizando",
  "Strengths": "Fortalezas",
  "Weaknesses": "Debilidades",
  "Enhance Responses": "Mejorar Respuestas",
  "Interviewer": "Entrevistador",
  "Your Response": "Tu Respuesta",
  "None": "Nada",
  "Interview Type": "Tipo de Entrevista",
  "Technical": "Técnica",
  "Behavioral": "Conductual",
  "Job Title": "Título profesional",
  "Sign In to Begin": "Inicia Sesión Para Comenzar",
  "Job Listing or Description": "Listado o Descripción de Trabajo",
  "Provide a brief job listing or description to help us ask relevant questions for. You can copy and paste directly from a job listing or description.": "Proporciona un breve anuncio de trabajo o descripción para ayudarnos a hacer preguntas relevantes. Puedes copiar y pegar directamente de un anuncio de trabajo o descripción.",
  "Upload a pdf, png, or jpeg of your resume to help the AI ask personalized questions.": "Sube un pdf, png o jpeg de tu currículum para ayudar a la IA a hacer preguntas personalizadas.",
  "Upload Resume": "Subir currículum"
}
